Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: Available when Storage is SIMD2<Int16>.
ja: StorageがSIMD2<Int16>である時に利用可能です。

source: Available when Storage is SIMD2<Int32>.
ja: StorageがSIMD2<Int32>である時に利用可能です。

source: Available when Storage is SIMD2<Int64>.
ja: StorageがSIMD2<Int64>である時に利用可能です。

source: Available when Storage is SIMD2<Int8>.
ja: StorageがSIMD2<Int8>である時に利用可能です。

source: Available when Storage is SIMD2<Int>.
ja: StorageがSIMD2<Int>である時に利用可能です。

source: Available when Storage is SIMD32<Int16>.
ja: StorageがSIMD32<Int16>である時に利用可能です。

source: Available when Storage is SIMD32<Int32>.
ja: StorageがSIMD32<Int32>である時に利用可能です。

source: Available when Storage is SIMD32<Int64>.
ja: StorageがSIMD32<Int64>である時に利用可能です。

source: Available when Storage is SIMD32<Int8>.
ja: StorageがSIMD32<Int8>である時に利用可能です。

source: Available when Storage is SIMD32<Int>.
ja: StorageがSIMD32<Int>である時に利用可能です。

source: Available when Storage is SIMD3<Int16>.
ja: StorageがSIMD3<Int16>である時に利用可能です。

source: Available when Storage is SIMD3<Int32>.
ja: StorageがSIMD3<Int32>である時に利用可能です。

source: Available when Storage is SIMD3<Int64>.
ja: StorageがSIMD3<Int64>である時に利用可能です。

source: Available when Storage is SIMD3<Int8>.
ja: StorageがSIMD3<Int8>である時に利用可能です。

source: Available when Storage is SIMD3<Int>.
ja: StorageがSIMD3<Int>である時に利用可能です。

source: Available when Storage is SIMD4<Int16>.
ja: StorageがSIMD4<Int16>である時に利用可能です。

source: Available when Storage is SIMD4<Int32>.
ja: StorageがSIMD4<Int32>である時に利用可能です。

source: Available when Storage is SIMD4<Int64>.
ja: StorageがSIMD4<Int64>である時に利用可能です。

source: Available when Storage is SIMD4<Int8>.
ja: StorageがSIMD4<Int8>である時に利用可能です。

source: Available when Storage is SIMD4<Int>.
ja: StorageがSIMD4<Int>である時に利用可能です。

source: Available when Storage is SIMD64<Int16>.
ja: StorageがSIMD64<Int16>である時に利用可能です。

source: Available when Storage is SIMD64<Int32>.
ja: StorageがSIMD64<Int32>である時に利用可能です。

source: Available when Storage is SIMD64<Int64>.
ja: StorageがSIMD64<Int64>である時に利用可能です。

source: Available when Storage is SIMD64<Int8>.
ja: StorageがSIMD64<Int8>である時に利用可能です。

source: Available when Storage is SIMD64<Int>.
ja: StorageがSIMD64<Int>である時に利用可能です。

source: Available when Storage is SIMD8<Int16>.
ja: StorageがSIMD8<Int16>である時に利用可能です。

source: Available when Storage is SIMD8<Int32>.
ja: StorageがSIMD8<Int32>である時に利用可能です。

source: Available when Storage is SIMD8<Int64>.
ja: StorageがSIMD8<Int64>である時に利用可能です。

source: Available when Storage is SIMD8<Int8>.
ja: StorageがSIMD8<Int8>である時に利用可能です。

source: Available when Storage is SIMD8<Int>.
ja: StorageがSIMD8<Int>である時に利用可能です。

source: Available when Success is Never and Failure is Never.
ja: SuccessがNeverであるそしてFailureがNeverである時に利用可能です。

source: Await a resume from a call to a yielding function.
ja: 生成関数へのある呼び出しからの再開を待ちます。

source: Awaiting on an empty group immediate returns nil without suspending.
ja: 空グループを待つことは、一時停止なしにnilを直ぐに返します。

source: Base glyphs that occupy their own space and do not combine with others.
ja: それら独自の空間を占有するそして他のものと結合していない基底字体。

source: Basic Arithmetic
ja: 基本算術

source: Basic Behaviors
ja: 基本の挙動

source: Basic Values
ja: 基本的な値

source: Basic string operations are not sensitive to locale settings, ensuring that string comparisons and other operations always have a single, stable result, allowing strings to be used as keys in Dictionary instances and for other purposes.
ja: 基本的な文字列演算はロケール設定に影響を受けず、文字列比較および他の演算が常にある単一の、安定した結果を持つことを保証して、文字列がDictionaryインスタンスにおけるキーとしておよび他の目的のために使われることを可能にしています。

source: Be sure to deallocate any memory that you manually allocate.
ja: あなたが手動でアロケートするあらゆるメモリをデアロケートするのを確実にしてください。

source: Because print(address:as:) requires an immutable pointer, although this is syntactically valid, it isn’t necessary.
ja: print(address:as:)が不変ポインタを要求することから、これは構文的には有効ですが、必要ではありません。

source: Because printInt(atAddress:) requires an immutable pointer, although this is syntactically valid, it isn’t necessary.
ja: printInt(atAddress:)が不変ポインタを要求することから、これは構文的には有効ですが、必要ではありません。

source: Because NSString is immutable, it is just as though the storage was shared by a copy.
ja: NSStringは不変であることから、まるでまさにストレージがコピーによって共有されたかのようです。

source: Because a Unicode scalar value can require more than a single ASCII character’s worth of storage, additional allocation may be necessary when adding to a Unicode scalar view after a call to reserveCapacity(_:).
ja: あるユニコードスカラー値が単一ASCII文字相当のストレージより多く要求する可能性があることから、reserveCapacity(_:)への呼び出しの後に文字ビューにあるユニコードスカラー値を追加する場合は、追加割り当てが必要かもしれません。

source: Because a Unicode scalar value can require up to 21 bits to store its value, some Unicode scalars are represented in UTF-16 by a pair of 16-bit code units.
ja: あるユニコードスカラー値はそれの値を格納するのに21ビットに至るまで要求できるので、いくつかのユニコードスカラーはUTF-16ではペア（一対）の16ビットコード単位によって表現されます。

source: Because a Unicode scalar value can require up to 21 bits to store its value, some Unicode scalars are represented in UTF-8 by a sequence of up to 4 code units.
ja: あるユニコードスカラー値はそれの値を格納するのに21ビットに至るまで要求できるので、いくつかのユニコードスカラーはUTF-8では４コード単位までのシーケンスによって表現されます。

source: Because a mutable typed pointer can be implicitly cast to an immutable pointer with the same Pointee type when passed as a parameter, you can also call printInt(atAddress:) with an UnsafeMutablePointer instance.
ja: 可変の型付ポインタは同じPointee型を持つ不変のポインタに暗黙的にキャストされることがパラメータとして渡される時に可能なことから、あなたはまたprintInt(atAddress:)をUnsafeMutablePointerインスタンスとともに呼び出せます。

source: Because all such functions are async they can only be invoked as part of an existing task, and therefore are guaranteed to be effective.
ja: そのような関数すべてがasyncであることからそれらは既存のタスクの一部として発動されることだけが可能です、そしてそれゆえ有効であることを保証されます。

source: Because any arbitrary subclass of NSString can become a String instance, there are no guarantees about representation or efficiency when a String instance is backed by NSString storage.
ja: NSStringの随意のサブクラスは何であれStringインスタンスになれるので、StringインスタンスがNSStringストレージによって裏打ちされる場合、表現または効率についての保証はありません。

source: Because both types have the same interface, you can replace one with the other in most circumstances, without making other changes.
ja: 両方の型は同じインターフェイスを持つため、あなたは多くの状況で一方を他方で置き換えることが、他の変更をすることなく可能です。

source: Because each character in a string can require more than a single ASCII character’s worth of storage, additional allocation may be necessary when adding characters to a string after a call to reserveCapacity(_:).
ja: ある文字列中の各文字が単一ASCII文字相当のストレージより多く要求する可能性があることから、reserveCapacity(_:)への呼び出しの後に文字列に文字を追加する場合は、追加割り当てが必要かもしれません。

source: Because of buffering, it is impossible to find the corresponding position in the iterator for a given returned Unicode.Scalar or an error.
ja: バッファを行うことのため、ある指定の戻り値Unicode.Scalarやエラーに対して対応する位置をイテレータにおいて見つけることは不可能です。

source: Because of this behavior, testing isEmoji alone on a single scalar is insufficient to determine if a unit of text is rendered as an emoji; a correct test requires inspecting multiple scalars in a Character.
ja: この挙動のために、isEmoji単独で単一のスカラー上でテストすることは、あるテキスト単位がemojiとして描出されるかを判定するには不十分です；正確なテストはあるCharacterの中の複数のスカラーを検査することを要求します。

source: Because of this, the index is always in-range and no trap can occur.
ja: このために、インデックスは常に範囲内です、そしてトラップは起こりえません。

source: Because the Int8 type can represent 127 at maximum, the attempt to create z with a value of 1000 results in a runtime error.
ja: Int8型は、最大で127を表せることから、zを1000の値で作成する試みは、実行時エラーという結果になります。

source: Because the strings are identical up to the 14th character, comparing only those characters results in a return value of 0.
ja: これら文字列が14番目の文字に至るまで全く同じなので、それらの文字だけ比較することは0の値を返す結果になります。

source: Because there is no key for 4, the closure returns nil in this case, which compactMap(_:) omits from the transformed asynchronous sequence.
ja: 4に対するキーがないことから、クロージャはnilをその場合には返します、それはcompactMap(_:)がこの変換された非同期シーケンスから省きます。

source: Because this buffer’s memory is no longer bound to its Element type while the body closure executes, do not access memory using the original buffer from within body.
ja: このバッファのもつメモリがそれのElement型にはbodyクロージャの実行の間はもはや束縛されないことから、メモリにオリジナルのバッファを使ってbody内からアクセスしないでください。

source: Because this pointer’s memory is no longer bound to its Pointee type while the body closure executes, do not access memory using the original pointer from within body.
ja: このポインタのメモリがそれのPointee型にはbodyクロージャの実行の間はもはや束縛されないことから、メモリにオリジナルのポインタを使ってbody内からアクセスしないでください。

source: Because typed pointers can be implicitly cast to raw pointers when passed as a parameter, you can also call print(address:as:) with any mutable or immutable typed pointer instance.
ja: 型付ポインタは暗黙的に生のポインタにキャストされることがパラメータとして渡される時に可能なことから、あなたはまたprint(address:as:)を何らかの可変または不変の型付ポインタとともに呼び出せます。

source: Because typed pointers can be implicitly cast to raw pointers when passed as a parameter, you can also call print(address:as:) with any mutable typed pointer instance.
ja: 型付ポインタは暗黙的に生のポインタにキャストされることがパラメータとして渡される時に可能なことから、あなたはまたprint(address:as:)を何らかの可変の型付ポインタとともに呼び出せます。

source: Before shifting, the masking left shift operator masks the shift to this range.
ja: シフトする前に、マスク左シフト演算子は、シフトをマスクしてこの範囲にします。

source: Before shifting, the masking right shift operator masks the shift to this range.
ja: シフトする前に、マスク右シフト演算子は、シフトをマスクしてこの範囲にします。

source: BinaryInteger Implementations
ja: バイナリ整数の実装

source: Binding task-local values
ja: タスクローカル値のバインド（束縛）

source: Binds the memory to the specified type and returns a typed pointer to the bound memory.
ja: メモリを指定された型へ束縛して、束縛されたメモリに対する型付ポインタを返します。

source: Binds the task-local to the specific value for the duration of the synchronous operation.
ja: タスクローカルを特定の値へとこの非同期演算の持続期間に対してバインドします。

source: Binds this buffer’s memory to the specified type and returns a typed buffer of the bound memory.
ja: このバッファの持つメモリを指定された型へ束縛して、束縛されたメモリに対する型付バッファを返します。

source: Bits are randomly distributed so that every value of T is equally likely to be returned.
ja: それらビットは無作為に分布します、それでTの全ての値は等しく返される可能性をもちます。

source: Bitwise AND
ja: ビット単位の積

source: Bitwise AND and assign
ja: ビット単位の積と代入

source: Bitwise NOT
ja: ビット単位否定

source: Bitwise OR
ja: ビット単位の和

source: Bitwise OR and assign
ja: ビット単位の和と代入

source: Bitwise XOR
ja: ビット単位の排他的和

source: Bitwise XOR and assign
ja: ビット単位の排他的和と代入

source: Bitwise left shift
ja: ビット単位の左シフト

source: Bitwise left shift, ignoring overflow
ja: ビット単位の左シフト、オーバーフローを無視します

source: Bitwise right shift
ja: ビット単位の右シフト

source: Bitwise right shift, ignoring overflow
ja: ビット単位の右シフト、オーバーフローを無視します

source: Both parameters must be valid indices of the buffer, and not equal to endIndex.
ja: 両方のパラメータは、バッファの有効なインデックスであり、そしてendIndexと等しくてはいけません。

source: Both parameters must be valid indices of the collection that are not equal to endIndex.
ja: 両方のパラメータは、このコレクションの有効なインデックスで、endIndexと等しくない必要があります。

source: Bounds checks are always performed in debug mode.
ja: 境界検査は、デバッグモードにおいて常に実行されます。

source: Bounds checks for bounds are performed only in debug mode.
ja: bounに対する境界検査は、デバッグモードでのみ実行されます。

source: Bounds checks for i are performed only in debug mode.
ja: iに対する境界検査は、デバッグモードでのみ実行されます。

source: Bridging Between String and NSString
ja: StringとNSStringの間のブリッジ

source: Buffer Implementation
ja: Buffer 実装

source: Build your own buffer-backed collection types.
ja: あなた独自のバッファ裏付けのコレクション型を組み立てます。

source: By default, a collection conforms to the Sequence protocol by supplying IndexingIterator as its associated Iterator type.
ja: 初期状態で、あるコレクションはSequenceプロトコルに、IndexingIteratorをそれの関連Iterator型として提供することによって準拠します。

source: By sending the output of the print(_:to:) function to an instance of ASCIILogger, you invoke its write(_:) method.
ja: print(_:to:)関数の出力をASCIILoggerのインスタンスに送ることによって、あなたはそれのwrite(_:)メソッドを発動します。

source: C Interoperability
ja: C互換性

source: C Variadic Functions
ja: C可変長引数関数

source: C and Objective-C Pointers
ja: CおよびObjective-Cポインタ

source: Calculates the result of shifting a value’s binary representation the specified number of digits to the right, masking the shift amount to the type’s bit width, and stores the result in the left-hand-side variable.
ja: ある値のバイナリ表現を指定された桁数だけ右にシフトする結果を計算します、シフト量をその型のもつビット幅にマスクしています、そして結果を左手側の変数に格納します。

source: Call body(p), where p is a pointer to the collection’s contiguous storage.
ja: body(p)を呼び出します、ここでpはコレクションのもつ隣接ストレージへのポインタです。

source: Call body(p), where p is a pointer to the collection’s mutable contiguous storage.
ja: body(p)を呼び出します、ここでpはコレクションのもつ可変の隣接ストレージへのポインタです。

source: Call randomElement() to select a random element from an array or another collection.
ja: randomElement()を呼び出して、ある無作為な要素を配列または別のコレクションから選んでください。

source: Call randomElement(using:) to select a random element from an array or another collection when you are using a custom random number generator.
ja: randomElement(using:)を呼び出して、あなたがあつらえの無作為数生成子を使っている場合に、ある無作為な要素を配列または別のコレクションから選んでください。

source: Call hasher.combine(_:) with each of these components.
ja: hasher.combine(_:)をそれら構成要素とともに呼び出してください。

source: Call the drinksUpdated after any code that sets the currentDrinks property, using an await call.
ja: drinksUpdatedを、currentDrinksプロパティを設定するあらゆるコードの後に呼び出してください、await呼出を使って。

source: Call the given output stream’s write(_:) method in your implementation.
ja: 与えられた出力ストリームのもつwrite(_:)メソッドをあなたの実装において呼び出してください。

source: Calling flatMap(_:) on a sequence s is equivalent to calling s.map(transform).joined().
ja: flatMap(_:)をあるシーケンスs上で呼び出すことは、s.map(transform).joined()を呼び出すことに等しいです。

source: Calling storeBytes(of:toByteOffset:as:) does not change the bound type of the memory.
ja: storeBytes(of:toByteOffset:as:)を呼び出すことは、そのメモリの束縛される型を変更しません。

source: Calling swapAt(_:_:) with the same index as both i and j has no effect.
ja: swapAt(_:_:)をiとj両方で同じインデックスで呼び出すことは、効果を持ちません。

source: Calling Functions With Pointer Parameters
ja: 関数をポインタパラメータで呼び出す

source: Calling Objective-C APIs Asynchronously
ja: Objective-C APIを非同期に呼び出す

source: Calling other APIs from another task is undefined behavior, breaks invariants in other parts of the program running on this task, and may lead to crashes or data loss.
ja: その他のAPIを別のタスクから呼び出すことは、未定義挙動になります、このタスク上で動作しているプログラムの他の部分における不変式を壊します、そしてクラッシュまたはデータ損失に至らしめるかもしれません。

source: Calling the move() method on a pointer p that references memory of type T is equivalent to the following code, aside from any cost and incidental side effects of copying and destroying the value:
ja: move()メソッドを、型Tのメモリを参照するポインタp上で呼び出すことは、その値のコピーおよび破棄のあらゆるコストと付随する副作用を除いて、以下のコードと同等です。

source: Calling the removeSubrange(_:) method instead is preferred.
ja: removeSubrange(_:)メソッドを代わりに呼ぶことが好まれます。

source: Calling the insert(contentsOf:at:) method instead is preferred.
ja: insert(contentsOf:at:)メソッドを代わりに呼ぶことが好まれます。

source: Calling the related sorted() method is equivalent to calling this method and passing the less-than operator (<) as the predicate.
ja: 関連したsorted()メソッドを呼び出すことは、このメソッドを呼び出して、より小さい演算子（<）を述部として渡すことと等しいです。

source: Calling this initializer copies the contents of the substring to a new string.
ja: このイニシャライザを呼ぶことは、下位文字列の内容を新しい文字列にコピーします。

source: Calling this method invalidates any existing indices for use with this string.
ja: このメソッドを呼び出すことは、この文字列で使うためのあらゆる既存のインデックスを無効にします。

source: Calling this method is roughly equivalent to calling initialize(repeating:count:) with a count of 1.
ja: このメソッドを呼び出すことは、おおよそinitialize(repeating:count:)を１のcountで呼び出すことに等しいです。

source: Calling this method may invalidate all saved indices of this collection.
ja: このメソッドを呼び出すことは、このコレクションの全ての保存されたインデックスを無効にします。

source: Calling this method may invalidate any existing indices for use with this collection.
ja: このメソッドを呼び出すことは、このコレクションで使うためのあらゆる既存のインデックスを無効にします。

source: Calling this property directly is discouraged.
ja: このプロパティを直接に呼び出すことは、推奨されません。

source: Calls the given closure on each element in the sequence in the same order as a for-in loop.
ja: 指定されたクロージャをそのシーケンスの各要素上でfor-inループと同じ順番で呼び出します。

source: Calls the given closure with a mutable pointer to the given argument.
ja: 与えられたクロージャを与えられた引数に対する可変ポインタを使って呼び出します。

source: Calls the given closure with a pointer to the contents of the string, represented as a null-terminated sequence of UTF-8 code units.
ja: null終端のUTF-8コード単位シーケンスとして表される、文字列の内容へのポインタとともに与えられたクロージャを呼び出します。

source: Calls the given closure with a pointer to the contents of the string, represented as a null-terminated sequence of code units.
ja: null終端のコード単位シーケンスとして表される、文字列の内容へのポインタとともに与えられたクロージャを呼び出します。

source: Calls the given closure with the with the “current” task in which this function was invoked.
ja: 与えられたクロージャを、それにおいてこの関数が発動されたところの “現在の” タスクで呼び出します。

source: Calls to async functions from synchronous functions are made by creating new asynchronous tasks, which can use await to wait for completion:
ja: async関数への非同期関数からの呼び出しは、新しい非同期タスクを作成することによって作られます、それらは awaitを使うことで完了に対して待機できます：

source: Calls to the CoffeeData object from SwiftUI views don’t require any use of await as these views are also on the main actor due to their use of @EnvironmentObject.
ja: CoffeeDataオブジェクトへのSwiftUIビューそれらからの呼び出しは、awaitのどのような利用も必要としません、それらのビューがまたメインアクター上で@EnvironmentObjectのそれらの使用によってするのと同じく。

source: Cancel all of the remaining tasks in the group.
ja: グループの中の残っているタスクの全てを取り消します。

source: Cancel all the remaining, and future, tasks in the group.
ja: グループの中の全ての残っている、そして将来の、タスクを取り消します。

source: Cancel the current task.
ja: 現在のタスクを取り消します。

source: Canceling Tasks
ja: タスクの取り消し

source: Cancellation
ja: 取り消し

source: Cancellation is a purely Boolean state; there’s no way to include additional information like the reason for cancellation.
ja: 取り消しはある純粋なブール状態です；取り消しの理由のような追加的情報を含める方法はありません。

source: Cancelling a task must be performed explicitly via cancel().
ja: あるタスクの取り消しは、明示的にcancel()経由で実行されなければなりません。

source: Cancelling a task must be performed explicitly via handle.cancel().
ja: あるタスクの取り消しは、明示的にhandle.cancel()経由で実行されなければなりません。

source: Canonical combining classes are defined in the Unicode Standard as integers in the range 0...254.
ja: 正準結合クラスは、「ユニコード標準」において整数として範囲0...254の中で定義されます。

source: Canonical combining classes are used by the ordering algorithm to determine if two sequences of combining marks should be considered canonically equivalent (that is, identical in interpretation).
ja: 正準結合クラスは、順序アルゴリズムによって使われて、２つの結合記号シーケンスが正準的に等しい（すなわち、解釈において同一）と考えられるべきかを決定します。

source: Cast instances of the Objective-C id type to a specific Swift type.
ja: Objective-C idのインスタンスをSwift型にキャストします。

source: Casting Between Integer Types
ja: 整数型の間でキャストする

source: Changing Case
ja: 大文字小文字の変更

source: Characters
ja: さまざまな文字

source: Check if the task is cancelled and throw an CancellationError if it was.
ja: タスクが取り消されるかどうか確認します、そしてそれがそうであったならばCancellationErrorをスローします。

source: Checking that the iterator was exhausted is not sufficient, because the decoder can store buffered data from the input iterator.
ja: イテレータが使い尽くされてしまったことの確認は十分とは言えません、デコーダが入力イテレータからのバッファ済みデータを格納できるからです。

source: Checks a necessary condition for making forward progress.
ja: これは進捗を前へ進めるために必要な条件を確認します。

source: Child tasks automatically carry priorities, task-local state, deadlines and have other benefits resulting from the structured concurrency concepts that they model.
ja: 子タスクそれらは、プロパティ、タスクにローカルな状態、最終期限を自動的に持ち運びます、そしてそれらを形作る構造化された並行性概念からの結果である他の利益を持ちます。

source: Child tasks automatically inherit their parent task’s priority.
ja: 子タスクそれらは、自動的にそれらの親タスクのもつ優先度を継承します。

source: Choosing the Smallest and Largest Value
ja: 最小および最大値を選ぶ

source: Click Delete Caffeine Data to clear all of the caffeine samples from HealthKit.
ja: Delete Caffeine Data をクリックして、カフェイン見本の全てを HealthKit から消去してください。

source: Click the Digital Crown to exit the app and return to the watch face.
ja: Digital Crownをクリックして、アプリを出て、ウォッチフェイスに戻ってください。

source: Click the Digital Crown to send the app to the background.
ja: Digital Crownをクリックして、アプリをバックグラウンドに送ってください。

source: Closed range
ja: 完結範囲

source: Closure Casting
ja: クロージャのキャスト

source: Cocoa Design Patterns
ja: Cocoaデザインパターン

source: Coffee Tracker updates the complication within 15 minutes; however, the update may be delayed based on the system’s current state.
ja: Coffee Tracker は、コンプリケーションを 15 分以内に更新します；しかしながら、更新はシステムの現在の状態に依存して遅れるかもしれません。

source: Collection Literals
ja: コレクションリテラル

source: Collection Mutability
ja: コレクションの可変性

source: Collection Traversal
ja: コレクション横断

source: Collections
ja: さまざまなコレクション

source: Collections of Indices
ja: インデックスのコレクション

source: Combine strings using the concatenation operator (+).
ja: 連結演算子（+）を使って文字列を結合してください。

source: Combining Unicode scalars do not have their own position in a string.
ja: 結合ユニコードスカラーは、それら自身の位置を文字列において持ちません。

source: Combining marks that are attached to hiragana and katakana to indicate voicing changes.
ja: ひらがなとカタカナに付けられて発声変化を指し示す結合記号。

source: Command Line Input
ja: コマンドライン入力

source: Command-line arguments for the current process.
ja: 現在のプロセスに対するコマンドライン引数。

source: Common data structures such as Array, Dictionary, and Set
ja: 一般的なデータ構造体、例えばArray、Dictionary、そしてSetなど

source: Common protocol to which all actors conform.
ja: それへと全てのアクターが準拠する共通プロコル。

source: Comparing Characters
ja: 文字の比較

source: Comparing Identity
ja: 同一性の比較

source: Comparing Scalars
ja: スカラーを比較する

source: Comparing Strings Using Operators
ja: 文字列を演算子を使って比較する

source: Comparing Tasks
ja: タスクを比較する

source: Comparing Values
ja: 値の比較

source: Comparing strings for equality using the equal-to operator (==) or a relational operator (like < or >=) is always performed using Unicode canonical representation.
ja: 同等演算子（==）または関係演算子（<や>=のような）を使って同等性について文字列を比較することは、常にユニコード正準表現を使って実行されます。

source: Comparing strings using the equal-to operator (==) or a relational operator (like < and >=) is always performed using the Unicode canonical representation, so that different representations of a string compare as being equal.
ja: 文字列を同等演算子（==）または関係演算子（<および>=）を使って比較することは、常にユニコード正準表現を使って実行されます、そのためある文字列の異なる表現は同等であると比較されます。

source: Compile-Time Strings
ja: コンパイル時文字列

source: Complexity: O(1)
ja: 計算量：O(1)

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is equal to maxLength.
ja: 計算量：コレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkはmaxLengthに相当します。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the absolute value of distance.
ja: 計算量：もしコレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkはdistanceの値の絶対値です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to drop from the beginning of the collection.
ja: 計算量：コレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkはコレクションの冒頭から除外する要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to drop.
ja: 計算量：コレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkは除外される要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to remove.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、そこでkは除去される要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to select from the beginning of the collection.
ja: 計算量：コレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkはコレクションの冒頭から選択する要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the resulting distance.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、そこでkは結果の隔たりです。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the specified number of elements.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、そこでkは指定した要素の数です。
